GetCalloutParentId Method
 Gets ID of the callout parent view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ElementId GetCalloutParentId()
Visual Basic
Public Function GetCalloutParentId As ElementId
Visual C++
public:
ElementId^ GetCalloutParentId()
Return Value
 ID of a view in which this callout was created or InvalidElementId if there is no parent.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  This view is not a callout.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →